app/controllers/blogs_controller.rb

INSERT INTO "blogs" ("name", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "MyString"], ["description", "MyText"], ["user_id", 1], ["created_at", 2017-08-18 13:14:10 UTC], ["updated_at", 2017-08-18 13:14:10 UTC]]
---
  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save

DELETE FROM "blogs" WHERE "blogs"."id" = ?  [["id", 980190962]]
---
  def destroy
    @blog.destroy

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
    def set_blog
      @blog = Blog.find(params[:id])