app/controllers/blogs_controller.rb

INSERT INTO "blogs" ("name", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Vinay"], ["description", "this is my first blog inside of docker compose and postgres"], ["user_id", 1], ["created_at", 2017-07-16 16:58:26 UTC], ["updated_at", 2017-07-16 16:58:26 UTC]]
---
  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save

UPDATE "blogs" SET "description" = $1, "updated_at" = $2 WHERE "blogs"."id" = $3  [["description", "this is my first blog inside of docker compose and postgres...\r\n"], ["updated_at", 2017-07-16 18:08:43 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @blog.update(blog_params)